TestPlans/Car/Debenhams/xml/DCI3_21112014_4.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="www.openecommerce.co.uk">
  <soap:Body>
    <ns1:getQuote>
      <requestXML>&lt;Request&gt;
  &lt;Product&gt;Motor&lt;/Product&gt;
  &lt;AggregatorID&gt;CTM1708&lt;/AggregatorID&gt;
  &lt;Quote Id="1"&gt;
    &lt;BrokerReference&gt;SAB0513&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="2"&gt;
    &lt;BrokerReference&gt;SAB0513&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;1&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="3"&gt;
    &lt;BrokerReference&gt;ELD19010&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="4"&gt;
    &lt;BrokerReference&gt;DSI0012606&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="5"&gt;
    &lt;BrokerReference&gt;KWR0104&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="6"&gt;
    &lt;BrokerReference&gt;PRC2407&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="7"&gt;
    &lt;BrokerReference&gt;INC807&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;1&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
  &lt;Quote Id="8"&gt;
    &lt;BrokerReference&gt;EDB0311&lt;/BrokerReference&gt;
    &lt;ReferrerCode&gt;ComparetheMarket&lt;/ReferrerCode&gt;
    &lt;QuoteMaximum&gt;1&lt;/QuoteMaximum&gt;
    &lt;AffiliateID&gt;0&lt;/AffiliateID&gt;
  &lt;/Quote&gt;
&lt;/Request&gt;</requestXML>
      <riskXML>&lt;Risk&gt;
  &lt;Policy&gt;
    &lt;CoverDate&gt;22/11/2014&lt;/CoverDate&gt;
    &lt;InsCancelled abiCode="N" /&gt;
    &lt;InsRefused abiCode="N" /&gt;
    &lt;ImposedTerms abiCode="N" /&gt;
    &lt;PrevPayment&gt;A&lt;/PrevPayment&gt;
    &lt;VolExcess&gt;700&lt;/VolExcess&gt;
    &lt;TotalVehiclesInHousehold&gt;5&lt;/TotalVehiclesInHousehold&gt;
  &lt;/Policy&gt;
  &lt;Person&gt;
    &lt;ContactEmail&gt;transformerPC04@emailreaction.org&lt;/ContactEmail&gt;
    &lt;ContactTelephone&gt;01733320300&lt;/ContactTelephone&gt;
    &lt;ContactAlternatePhone&gt;01733320300&lt;/ContactAlternatePhone&gt;
    &lt;Address1&gt;2 Duke of Edinburgh Way&lt;/Address1&gt;
    &lt;Address2&gt;Malvern&lt;/Address2&gt;
    &lt;Address3 /&gt;
    &lt;Address4 /&gt;
    &lt;PostCode&gt;WR14 1AZ&lt;/PostCode&gt;
    &lt;AnothersBus&gt;N&lt;/AnothersBus&gt;
    &lt;Commuting abiCode="Y" /&gt;
    &lt;EmpBus abiCode="N" /&gt;
    &lt;ExtendedUse abiCode="Y" /&gt;
    &lt;PersonalBus abiCode="Y" /&gt;
    &lt;PrivateHire abiCode="N" /&gt;
    &lt;PublicHire abiCode="N" /&gt;
    &lt;Soliciting abiCode="N" /&gt;
    &lt;CarriageOfGoods abiCode="N" /&gt;
    &lt;OtherOwnVehInd abiCode="N" /&gt;
    &lt;OtherOwnVehType /&gt;
    &lt;OtherCompanyVehInd abiCode="Y" /&gt;
    &lt;OtherVehProp /&gt;
    &lt;DriveOthVehicles abiCode="Y" /&gt;
    &lt;OtherCompanyVehSoleUse abiCode="Y" /&gt;
    &lt;DateMovedToUK&gt;1978-04-04&lt;/DateMovedToUK&gt;
    &lt;DateOfBirth&gt;04/04/1978&lt;/DateOfBirth&gt;
    &lt;DrvStatus abiCode="M" /&gt;
    &lt;FirstName&gt;Debbie&lt;/FirstName&gt;
    &lt;Gender abiCode="F" /&gt;
    &lt;HasNonMotorConv abiCode="N" /&gt;
    &lt;HomeOwner abiCode="Y" /&gt;
    &lt;LicHeld&gt;45&lt;/LicHeld&gt;
    &lt;LicType abiCode="I" /&gt;
    &lt;LicUnit&gt;M&lt;/LicUnit&gt;
    &lt;MaritalStatus abiCode="S" /&gt;
    &lt;OtherCompanyVehYears&gt;0&lt;/OtherCompanyVehYears&gt;
    &lt;OtherCompanyVehNCB&gt;4&lt;/OtherCompanyVehNCB&gt;
    &lt;Surname&gt;Four&lt;/Surname&gt;
    &lt;Title&gt;Miss&lt;/Title&gt;
    &lt;Incident&gt;
      &lt;PercentRecovered&gt;0&lt;/PercentRecovered&gt;
      &lt;AtFault&gt;Y&lt;/AtFault&gt;
      &lt;IncidentType&gt;NoV&lt;/IncidentType&gt;
      &lt;BodilyInj abiCode="N" /&gt;
      &lt;ClaimDate&gt;01/04/2012&lt;/ClaimDate&gt;
      &lt;ClaimValue&gt;0.00&lt;/ClaimValue&gt;
      &lt;ClmType abiCode="A" /&gt;
      &lt;NCBAff&gt;Y&lt;/NCBAff&gt;
      &lt;Date&gt;01/04/2012&lt;/Date&gt;
    &lt;/Incident&gt;
    &lt;InfInd&gt;N&lt;/InfInd&gt;
    &lt;Occupation&gt;
      &lt;BusType abiCode="186" /&gt;
      &lt;EmpStat abiCode="F" /&gt;
      &lt;FullPart abiCode="Y" /&gt;
      &lt;OccType abiCode="S52" /&gt;
    &lt;/Occupation&gt;
    &lt;PrivateMileage&gt;5000&lt;/PrivateMileage&gt;
    &lt;BusinessMileage&gt;5000&lt;/BusinessMileage&gt;
  &lt;/Person&gt;
  &lt;Person&gt;
    &lt;AnothersBus abiCode="N" /&gt;
    &lt;Commuting abiCode="N" /&gt;
    &lt;EmpBus abiCode="N" /&gt;
    &lt;ExtendedUse abiCode="N" /&gt;
    &lt;PersonalBus abiCode="N" /&gt;
    &lt;PrivateHire abiCode="N" /&gt;
    &lt;PublicHire abiCode="N" /&gt;
    &lt;Soliciting abiCode="N" /&gt;
    &lt;CarriageOfGoods abiCode="N" /&gt;
    &lt;OtherOwnVehInd abiCode="N" /&gt;
    &lt;OtherOwnVehType /&gt;
    &lt;OtherCompanyVehInd abiCode="Y" /&gt;
    &lt;OtherVehProp /&gt;
    &lt;DriveOthVehicles abiCode="Y" /&gt;
    &lt;OtherCompanyVehSoleUse abiCode="N" /&gt;
    &lt;DateMovedToUK&gt;1979-09-07&lt;/DateMovedToUK&gt;
    &lt;DateOfBirth&gt;07/09/1979&lt;/DateOfBirth&gt;
    &lt;DrvStatus abiCode="F" /&gt;
    &lt;FirstName&gt;Denise&lt;/FirstName&gt;
    &lt;Gender abiCode="F" /&gt;
    &lt;HasNonMotorConv abiCode="N" /&gt;
    &lt;LicHeld&gt;8&lt;/LicHeld&gt;
    &lt;LicType abiCode="P" /&gt;
    &lt;LicUnit&gt;Y&lt;/LicUnit&gt;
    &lt;MaritalStatus abiCode="S" /&gt;
    &lt;OtherCompanyVehNCB&gt;4&lt;/OtherCompanyVehNCB&gt;
    &lt;Surname&gt;Four&lt;/Surname&gt;
    &lt;Title&gt;Ms&lt;/Title&gt;
    &lt;Incident&gt;
      &lt;PercentRecovered&gt;0&lt;/PercentRecovered&gt;
      &lt;AtFault&gt;Y&lt;/AtFault&gt;
      &lt;IncidentType&gt;NoV&lt;/IncidentType&gt;
      &lt;BodilyInj abiCode="N" /&gt;
      &lt;ClaimDate&gt;01/11/2011&lt;/ClaimDate&gt;
      &lt;ClaimValue&gt;0.00&lt;/ClaimValue&gt;
      &lt;ClmType abiCode="F" /&gt;
      &lt;NCBAff&gt;Y&lt;/NCBAff&gt;
      &lt;Date&gt;01/11/2011&lt;/Date&gt;
    &lt;/Incident&gt;
    &lt;InfInd&gt;N&lt;/InfInd&gt;
    &lt;Occupation&gt;
      &lt;BusType abiCode="186" /&gt;
      &lt;EmpStat abiCode="H" /&gt;
      &lt;FullPart abiCode="Y" /&gt;
      &lt;OccType abiCode="H09" /&gt;
    &lt;/Occupation&gt;
    &lt;RelationshipToProp abiCode="O" /&gt;
  &lt;/Person&gt;
  &lt;Vehicle&gt;
    &lt;ABICode&gt;16553803&lt;/ABICode&gt;
    &lt;AlarmSecurityFitted&gt;Unknown&lt;/AlarmSecurityFitted&gt;
    &lt;CoverType abiCode="01" /&gt;
    &lt;EstimatedValue&gt;3000&lt;/EstimatedValue&gt;
    &lt;Keeper abiCode="H" /&gt;
    &lt;Lhd&gt;N&lt;/Lhd&gt;
    &lt;Modified abiCode="Y" /&gt;
    &lt;NCBYears&gt;0&lt;/NCBYears&gt;
    &lt;NightLocation abiCode="3" /&gt;
    &lt;Owner abiCode="H" /&gt;
    &lt;OvernightPostCode&gt;WR14 1AZ&lt;/OvernightPostCode&gt;
    &lt;PurchaseDate&gt;01/09/2012&lt;/PurchaseDate&gt;
    &lt;Registration&gt;WM11ENP&lt;/Registration&gt;
    &lt;YearManufacture&gt;2011&lt;/YearManufacture&gt;
    &lt;Seats&gt;4&lt;/Seats&gt;
    &lt;Modification&gt;
      &lt;Description&gt;RV&lt;/Description&gt;
    &lt;/Modification&gt;
    &lt;Modification&gt;
      &lt;Description&gt;FS&lt;/Description&gt;
    &lt;/Modification&gt;
  &lt;/Vehicle&gt;
&lt;/Risk&gt;</riskXML>
    </ns1:getQuote>
  </soap:Body>
</soap:Envelope>